# ЗАДАНИЕ - Прямоугольный треугольник

puts "Введите значение первой стороны треугольника (a):"
a = gets.to_f
a = a**2

puts "Введите значение второй стороны треугольника (b):"
b = gets.to_f
b = b**2

puts "Введите значение третьей стороны треугольника (c): "
c = gets.to_f
c = c**2

if a == b && b == c
    puts "Треугольник равнобедренный и равносторонний"
elsif (a == b || a == c) || (b == a || b == c) || (c == a || c == b)
    puts "Треугольник равносторонний"
elsif (a == (b + c)) || (b == (a + c)) || (c == (a + b))
    puts "Треугольник прямоугольный"
else
    puts "Разносторонний треугольник"
end