=begin
ЗАДАНИЕ - Сумма покупок. Пользователь вводит поочередно название товара, цену за единицу и кол-во купленного товара 
(может быть нецелым числом). 
Пользователь может ввести произвольное кол-во товаров до тех пор, пока не введет "стоп" в качестве названия товара. 
На основе введенных данных требуетеся:
Заполнить и вывести на экран хеш, ключами которого являются названия товаров, а значением - вложенный хеш, 
содержащий цену за единицу товара и кол-во купленного товара. Также вывести итоговую сумму за каждый товар.
Вычислить и вывести на экран итоговую сумму всех покупок в "корзине".
=end

basket = {}

loop do
  
  price_hh = {}

  puts "Введите название товара (Введите \"стоп\" что бы выйти): "
  product = gets.strip

  if 'стоп' == product
    puts "Конец ввода."
    puts # для более читабельного вывода в терминале
    break
  end

  puts "Введите цену за единицу: "
  price = gets.to_f

  puts "Введите количество купленного товара: "
  things = gets.to_i

  price_hh[price] = things
  basket[product] = price_hh

end

arr = []

basket.each do |key, value|
  puts "Товар: #{key}"
  value.each do |k, v|
    puts "Цена за единицу: #{k}руб."
    puts "Количество: #{v}шт."
    puts "Итоговая сумма за каждый товар: #{k * v}руб"
    puts # для более читабельного вывода в терминале
    arr << k * v
  end
end

puts "Итоговая сумма: #{arr.sum}руб"
